<?php
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 黎小龙 <shalinglom@gmail.com>
// +----------------------------------------------------------------------
// | CreateTime: 2018/8/5 
// +----------------------------------------------------------------------

return [
    //管理员用户密码盐值
    'default_salt'          => '99jia',
    //零售价比例
    'price_ratio'           => 1.3,
    //厂家质量保证金，额度与星级
    'margin_star'           => [
        1000    => 1,
        2000    => 2,
        3000    => 3,
        12000   => 4
    ],
    //收藏、关注、点赞
    'msg_for_frequently' => '点太快了，别急',

    //个人贡献人气值增长间隔时间   1 小时
    'popularity_time'   => 3600,

    //个人贡献文章阅读量值增长间隔时间   1 小时
    'read_interval_time'   => 3600,
];
