<?php
// +----------------------------------------------------------------------
// | 深圳市保联科技有限公司
// +----------------------------------------------------------------------
// | Copyright (c) 2013-2017 http://www.luckyins.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 黎小龙 <shalinglom@gmail.com>
// +----------------------------------------------------------------------

return [
    //公众号 AppID
    'gzh_app_id'            => '',
    //公众号 AppSecret
    'gzh_app_secret'        => '',

    //小程序 AppID
    'xcx_app_id'            => '',
    //小程序 AppSecret
    'xcx_app_secret'        => '',

    //SMS
    'sms_app_id'            => '',
    'sms_app_key'           => '',
];
