<?php
// +----------------------------------------------------------------------
// | 深圳市保联科技有限公司
// +----------------------------------------------------------------------
// | Copyright (c) 2013-2017 http://www.luckyins.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 黎小龙 <shalinglom@gmail.com>
// +----------------------------------------------------------------------

return [
    //公众号 AppID
    'gzh_app_id'            => 'wxa6d691299093f1a4',
    //公众号 AppSecret
    'gzh_app_secret'        => '7a91a512262ec4a9dea5a507612e48a0',
    //小程序 AppID
    'xcx_app_id'            => 'wx195a5e8ed1a55ead',
    //小程序 AppSecret
    'xcx_app_secret'        => '7a91a512262ec4a9dea5a507612e48a0',

    //SMS
    'sms_app_id'            => '1400108281',
    'sms_app_key'           => 'fe504050bd4bcaed5651ed2f1a093611',
];