<?php
// +----------------------------------------------------------------------
// | 深圳市保联科技有限公司
// +----------------------------------------------------------------------
// | Copyright (c) 2013-2017 http://www.luckyins.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 黎小龙 <shalinglom@gmail.com>
// +----------------------------------------------------------------------

namespace Config;

class Db
{
    public static $dataBase = array(
        'host'    => '47.98.223.33',
        'port'    => 3306,
        'user'    => 'user',
        'password' => 'lucky2018',
        'dbname'  => 'furniture',
        'charset'    => 'utf8',
    );
}